InformationRegisters/ЛБ_РеестрБезначныхПлатежейПереплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеестрБезначныхПлатежейПереплаты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаСотрудникомЦО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПереплатаНачальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РеестрБезначныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеестрБезначныхПлатежей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОЗаемщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаСотрудникомЦО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыБезналичныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыБезналичныхПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныйКабинет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_УточнениеБезналичногоПлатежа/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РеестрПлатежей") Тогда
		РеестрПлатежей = Параметры.РеестрПлатежей; 
		Если Параметры.Свойство("ДатаПлатежа") Тогда 
			ДатаПлатежа = Параметры.Датаплатежа;
		КонецЕсли;	
		Если Параметры.Свойство("ИдентификаторПлатежа") Тогда 
			ИдентификаторПлатежа = Параметры.ИдентификаторПлатежа;
		КонецЕсли;	
        Если Параметры.Свойство("СуммаПлатежа") Тогда 
			СуммаПлатежа = Параметры.СуммаПлатежа;
		КонецЕсли;	
        Если Параметры.Свойство("НомерЗБ") Тогда 
			НомерЗБ = Параметры.НомерЗБ;
		КонецЕсли;	
		Если Параметры.Свойство("Переплата") Тогда 
			Переплата = Параметры.Переплата;
		КонецЕсли;	
	Иначе
		Возврат;
	КонецЕсли;	     
	//ИнформацияПлатеж = "Реестр платежей № " + СокрЛП(РеестрПлатежей.НомерРеестра) + "/" + СокрЛП(РеестрПлатежей.ИмяФайла);  
	ИнформацияПлатеж = "Реестр платежей "  + СокрЛП(РеестрПлатежей.ИмяФайла);
	Если РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда		
	    ИнформацияПлатеж = ИнформацияПлатеж + Символы.ПС + "п/п № " + СокрЛП(ИдентификаторПлатежа) + " от " + Формат(ДатаПлатежа, "ДЛФ=DT");
	Иначе
		ИнформацияПлатеж = ИнформацияПлатеж + Символы.ПС + СокрЛП(ИдентификаторПлатежа) + " от " + Формат(ДатаПлатежа, "ДЛФ=DT");
	КонецЕсли;	  
	ИнформацияПлатеж = ИнформацияПлатеж + Символы.ПС + "Сумма " + ?(Переплата, "переплаты", "платежа") + " для распределения " + Формат(СуммаПлатежа, "ЧЦ=15; ЧДЦ=2") + " руб.";
	Элементы.ДекорацияПлатеж.Заголовок = ИнформацияПлатеж;
КонецПроцедуры


&НаСервере
Функция ПроверитьПлатеж()
	Если НЕ ЗначениеЗаполнено(ЗалоговыйБилет) Тогда 				
	    Возврат "Залоговый билет № " + СокрЛП(НомерЗБНовый) + " в базе не найден.";
	Иначе                                                                                              
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДатаСеанса(), ЗалоговыйБилет); 
		Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт ИЛИ 
			 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтвественноеХранение ИЛИ   
			 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления ИЛИ
			 СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Отгружен Тогда   
			Возврат "Залоговый билет № " + СокрЛП(НомерЗБНовый) + " в статусе " + строка(СтатусЗБ) + "."; 
		ИначеЕсли ЛБ_ОбщийМодуль.ПроверитьЕстьОплатыКасса(РеестрПлатежей.ВидОперации, РеестрПлатежей.Дата, ДатаПлатежа, ЗалоговыйБилет) Тогда  
			Если РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
			    Возврат "По залоговый билету № " + СокрЛП(НомерЗБНовый) + " есть наличные оплаты позже " + Формат(КонецДня(ДатаПлатежа), "ДЛФ=DT"); 
			ИначеЕсли РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
			    Возврат "По залоговый билету № " + СокрЛП(НомерЗБНовый) + " есть наличные оплаты в промежутке между датой платежа и датой загрузки реестра.";
			КонецЕсли;		
		Иначе                                     
			РезультатРасчета = ЛБ_Общиймодуль.ПроверитьРасчетыПоЗалоговомуБилету(ДатаПлатежа, ЗалоговыйБилет);
			Если РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда
				Если (РезультатРасчета.ОстатокПроценты + РезультатРасчета.ОстатокЗайм) <= 0 Тогда
				   Возврат "По залоговый билету № " + СокрЛП(НомерЗБНовый) + " проценты на дату платежа не начислены и не определен остаток задолженности по телу займа.";
				КонецЕсли;  
			ИначеЕсли РеестрПлатежей.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет Тогда  
				Если РезультатРасчета.ОстатокПроценты <= 0 Тогда
				    Возврат "По залоговый билету № " + СокрЛП(НомерЗБНовый) + " проценты на дату платежа не начислены.";
				КонецЕсли; 
	        КонецЕсли;
		КонецЕсли;	
	КонецЕсли;  
	Возврат "";
КонецФункции

&НаКлиенте
Процедура Зачислить(Команда)
	Если НЕ ЗначениеЗаполнено(ЗалоговыйБилет) Тогда 
		Предупреждение("Не выбран залоговый билет.", 60); 
		Возврат;
	КонецЕсли;
	
	СообщениеОбОшибке = ПроверитьПлатеж();
	Если НЕ ПустаяСтрока(СообщениеОбОшибке) Тогда
		Предупреждение(СообщениеОбОшибке, 60);
	Иначе	
		СтруктураВ = новый Структура;
		СтруктураВ.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
		СтруктураВ.Вставить("НомерЗБ", НомерЗБНовый);
	    Закрыть(СтруктураВ);   
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(неопределено);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаемщика(ЗалоговыйБилет)
	Возврат ЗалоговыйБилет.Залогодатель;
КонецФункции

&НаСервере
Функция ПолучитьЗБ(НомерЗБ)  
	Если НЕ ПустаяСтрока(НомерЗБ) Тогда
	    Возврат ЛБ_Общиймодуль.ПолучитьЗБПоНомеру(НомерЗБ);  
	КонецЕсли;
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
КонецФункции  

&НаКлиенте
Процедура ПоискПоНомеруЗБ(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЗБ", ЭтаФорма);	
 
    ПоказатьВводЗначения(
        Оповещение,
        , 
		"Введите номер ЗБ",
        "Строка"
    );
КонецПроцедуры   

&НаСервере
Функция ПолучитьДолгЗБ() 
	Возврат ЛБ_Общиймодуль.ПроверитьРасчетыПоЗалоговомуБилету(ДатаПлатежа, ЗалоговыйБилет);
КонецФункции

&НаСервере
Функция ПроверитьДвижениеБН(ЗалоговыйБилет)     
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей); 	
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИСТИНА КАК Переплата,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.ДатаПлатежа КАК ДатаПлатежа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежейПереплаты КАК ЛБ_РеестрБезначныхПлатежейПереплаты
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежейПереплаты.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РеестрБезначныхПлатежейПереплаты.ЗалоговыйБилет = &ЗалоговыйБилет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛОЖЬ,
	               |	ЛБ_РеестрБезначныхПлатежей.ИдентификаторПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежей.ДатаПлатежа
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей КАК ЛБ_РеестрБезначныхПлатежей
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежей.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И НЕ ЛБ_РеестрБезначныхПлатежей.Регистратор = &РеестрПлатежей"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураВ = Новый структура;
		СтруктураВ.Вставить("Переплата", Выборка.Переплата); 
		СтруктураВ.Вставить("ИдентификаторПлатежа", Выборка.ИдентификаторПлатежа);
        СтруктураВ.Вставить("ДатаПлатежа", Выборка.ДатаПлатежа);
		Возврат СтруктураВ;
	КонецЕсли;	
	Возврат неопределено;
КонецФункции	

&НаКлиенте
Процедура ПослеВыбораЗБ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	НомерЗБНовый = Результат; 
	ЗалоговыйБилет = ПолучитьЗБ(НомерЗБНовый); 	
	
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда 
		//Результат = ПроверитьДвижениеБН(ЗалоговыйБилет);
		//Если Результат = неопределено тогда 
		Залогодатель = ПолучитьЗаемщика(ЗалоговыйБилет);
		РезультатРасчета = ПолучитьДолгЗБ(); 
		ДолгПроценты = РезультатРасчета.ОстатокПроценты;
		ДолгЗайм = РезультатРасчета.ОстатокЗайм; 
		//Иначе
		//	НомерЗБНовый = "";
		//	Предупреждение("По выбранному залоговому билету в реестре уже сделан зачет " + ?(Результат.Переплата, "переплаты", "платежа") +  " (№ п.п " + СокрЛП(Результат.ИдентификаторПлатежа) + " от " + Формат(Результат.ДатаПлатежа, "ДЛФ=DT")+ ")", 60);
		//	Возврат;
		//КонецЕсли;	

	Иначе 
		Предупреждение("Залоговый билет № " + СокрЛП(НомерЗБНовый) + " в базе не найден.", 60);
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура Расчет(Команда)
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);		
		ПараметрыФормы.Вставить("Дата", ДатаПлатежа);	 
		ПараметрыФормы.Вставить("Детально", Истина);
					
        ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;		
КонецПроцедуры
